'''
Домашнє завдання
1. Реалізуйте генераторну функцію, яка повертатиме по одному члену геометричної прогресії із зазначеним множником.
 Генератор повинен зупинити свою роботу або після досягнення зазначеного елементу, або при передачі команди на завершення.
2. Реалізуйте свій аналог генераторної функції range().
3. Напишіть функцію-генератор, яка повертатиме прості числа. Верхня межа діапазону повинна бути задана параметром цієї функції.
4. Напишіть генераторний вираз для заповнення списку. Список повинен бути заповнений кубами чисел від 2 до вказаної вами величини.
'''
